[
  {
    "id": "aks",
    "shortname": "AKS",
    "name": "Azure Kubernetes Service",
    "tagline": "Deploy and scale containers on managed Kubernetes by Microsoft",
    "url": "https://azure.microsoft.com/en-us/services/kubernetes-service",
    "logo": "https://swimburger.net/media/ppnn3pcl/azure.png",
    "category": "managed-kubernetes",
    "features": {
      "initial-release": "Jun '18",
      "max-pods-per-node": "250",
      "free-control-plane": "✅",
      "control-plane-sla": "99.95%",
      "private-cluster": "✅"
    },
    "alternatives": [
      "gke",
      "doks",
      "eks"
    ],
    "description": "Azure Kubernetes Service (AKS) is a cloud-based platform offered by Microsoft Azure that simplifies the deployment, management, and scaling of containerized applications using Kubernetes. It provides a user-friendly environment for businesses to efficiently run their applications without the complexity of handling underlying infrastructure. With AKS, users can focus on developing and delivering applications rather than dealing with the intricacies of Kubernetes orchestration.\n\nOne of the key reasons people choose Azure Kubernetes Service is its seamless integration with other Microsoft Azure services. AKS easily integrates with Azure DevOps for streamlined application development and deployment pipelines, enhancing collaboration among development and operations teams. Additionally, AKS offers robust security features, ensuring that applications are protected throughout their lifecycle. Users appreciate the automatic updates and patches, reducing the burden of maintenance and enhancing the overall reliability of their applications.\n\nAzure Kubernetes Service stands out for its scalability, allowing businesses to effortlessly scale their applications based on demand. It efficiently manages resources, optimizing costs and providing a cost-effective solution for various workloads. The simplified deployment process, integration capabilities, security features, and scalability make Azure Kubernetes Service a preferred choice for organizations seeking a hassle-free and efficient platform to run their containerized applications in the cloud.\n",
    "issue": 2,
    "images": [],
    "reviews": [],
    "reactions": []
  },
  {
    "id": "aptakube",
    "name": "Aptakube",
    "tagline": "Modern, lightweight and multi-cluster Kubernetes GUI",
    "url": "https://aptakube.com",
    "logo": "https://aptakube.com/apple-touch-icon.png",
    "category": "desktop-clients",
    "features": {
      "interface": "Graphical",
      "multi-cluster": "✅",
      "port-foward": "✅",
      "aggregated-logs": "✅",
      "open-source": "❌"
    },
    "alternatives": [
      "k9s",
      "lens"
    ],
    "description": "Aptakube is Kubernetes GUI to help you manage your Kubernetes cluster, view logs, create and edit resources, and more — all in a user-friendly and intuitive UI. The app runs on your desktop and does not require any server or additional components to operate. It's like a graphical version of `kubectl` on steroids.\n\nIt's designed to be a simple and straightforward tool to get things done without getting in your way. One of its unique features is the ability to connect to multiple clusters at the same time, which gives you the feeling of a single cluster with a global view of all resources spread across multiple clusters.\n\n- 💯 Connect to one or more clusters simultaneously\n- ⚡️ Aggregated Log Viewer\n- 💪 Human-friendly resource view\n- ✍️ View & modify objects\n- 🎉 Zero-config setup\n- 😉 NOT another Electron app\n- ✅ Works with any Kubernetes cluster: on-prem, GKE, EKS, AKS and others.\n- 💻 Available on Windows, macOS and Linux\n",
    "issue": 3,
    "images": [],
    "reviews": [],
    "reactions": [
      {
        "login": "goenning",
        "content": "+1",
        "avatar_url": "https://avatars.githubusercontent.com/u/94755?v=4",
        "created_at": "2024-01-16T08:59:52Z"
      }
    ]
  },
  {
    "id": "doks",
    "shortname": "DOKS",
    "name": "Digital Ocean Kubernetes",
    "tagline": "Kubernetes at scale managed for you",
    "url": "https://www.digitalocean.com/products/kubernetes",
    "logo": "https://static-00.iconduck.com/assets.00/digitalocean-icon-512x512-1t8a5xew.png",
    "category": "managed-kubernetes",
    "features": {
      "initial-release": "Dec '18",
      "max-pods-per-node": "110",
      "free-control-plane": "✅",
      "control-plane-sla": "99.95%",
      "private-cluster": "❌"
    },
    "alternatives": [
      "gke",
      "aks",
      "eks"
    ],
    "description": "Digital Ocean Kubernetes Service is a reliable and straightforward platform that empowers users to effortlessly deploy and manage their containerized applications. It provides a user-friendly experience, making it an attractive choice for developers and small to medium-sized businesses looking for a hassle-free Kubernetes solution. With Digital Ocean Kubernetes Service, users can efficiently handle the complexities of deploying and scaling applications without getting bogged down by intricate configurations.\n\nOne notable feature of Digital Ocean Kubernetes Service is its simplicity in both setup and pricing. Users appreciate the straightforward and transparent pricing model, which allows them to easily understand and predict their costs. This simplicity extends to the platform's intuitive user interface, making it accessible for those new to Kubernetes or container orchestration, eliminating the need for advanced technical expertise.\n\nAnother key reason for choosing Digital Ocean Kubernetes Service is its strong focus on community support and documentation. Digital Ocean has a robust community of users who actively share knowledge and experiences. This collaborative environment, coupled with well-documented resources, ensures that users can find solutions to common challenges and get assistance when needed. The combination of user-friendly features, transparent pricing, and strong community support makes Digital Ocean Kubernetes Service a popular choice for those seeking a straightforward and effective Kubernetes solution.\n",
    "issue": 4,
    "images": [],
    "reviews": [],
    "reactions": []
  },
  {
    "id": "eks",
    "shortname": "EKS",
    "name": "Elastic Kubernetes Service",
    "tagline": "The most trusted way to start, run, and scale Kubernetes",
    "url": "https://aws.amazon.com/eks",
    "logo": "https://seeklogo.com/images/A/amazon-web-services-aws-logo-6C2E3DCD3E-seeklogo.com.png",
    "category": "managed-kubernetes",
    "features": {
      "initial-release": "Jun '18",
      "max-pods-per-node": "110",
      "free-control-plane": "❌",
      "control-plane-sla": "99.95%",
      "private-cluster": "✅"
    },
    "alternatives": [
      "gke",
      "doks",
      "aks"
    ],
    "description": "Elastic Kubernetes Service (EKS) is a cloud-based platform that simplifies the deployment and management of containerized applications. Developed by Amazon Web Services (AWS), EKS is designed to provide users with a seamless and reliable experience for running applications in containers. It is a popular choice among businesses and developers who are already leveraging AWS services and infrastructure for their cloud needs.\n\nOne significant advantage of Elastic Kubernetes Service is its deep integration with the broader AWS ecosystem. Users benefit from a unified environment where they can seamlessly connect EKS with other AWS services, simplifying tasks such as storage, networking, and security. This integration allows for a streamlined experience, enabling users to leverage the full capabilities of AWS while managing their containerized applications.\n\nElastic Kubernetes Service is chosen by many organizations for its scalability and reliability. AWS, known for its robust and highly available infrastructure, ensures that EKS users can easily scale their applications based on demand. The reliability of AWS infrastructure, combined with the managed nature of EKS, provides a stable environment for running containerized workloads. These features make Elastic Kubernetes Service a preferred choice for businesses seeking a dependable and seamlessly integrated Kubernetes solution within the AWS ecosystem.\n",
    "issue": 5,
    "images": [],
    "reviews": [],
    "reactions": []
  },
  {
    "id": "gke",
    "shortname": "GKE",
    "name": "Google Kubernetes Engine",
    "tagline": "The most scalable and fully automated Kubernetes service",
    "url": "https://cloud.google.com/kubernetes-engine",
    "logo": "https://seeklogo.com/images/G/google-cloud-logo-ADE788217F-seeklogo.com.png",
    "category": "managed-kubernetes",
    "features": {
      "initial-release": "Nov '15",
      "max-pods-per-node": "110",
      "free-control-plane": "✅",
      "control-plane-sla": "99.95%",
      "private-cluster": "✅"
    },
    "alternatives": [
      "aks",
      "doks",
      "eks"
    ],
    "description": "Google Kubernetes Engine (GKE) is a powerful and user-friendly platform that simplifies the deployment, management, and scaling of containerized applications. It is a cloud-based service provided by Google Cloud that enables users to efficiently run applications in containers without the hassle of dealing with the underlying infrastructure. GKE is widely appreciated for its ease of use and seamless integration with other Google Cloud services.\n\nOne key advantage of GKE is its robust automation capabilities. It automates many tasks related to application deployment and scaling, allowing users to focus on developing and improving their applications rather than managing the underlying infrastructure. Additionally, GKE offers excellent scalability, enabling users to effortlessly scale their applications up or down based on demand. This flexibility is crucial for businesses with dynamic workloads.\n\nGKE's popularity stems from its reliability and security features. Google, known for its expertise in managing large-scale infrastructure, ensures that GKE users benefit from a highly available and secure platform. Many organizations choose GKE over alternatives due to its seamless integration with Google Cloud services, simplified operational tasks, and the assurance of a stable and secure environment for running containerized applications.\n",
    "issue": 6,
    "images": [],
    "reviews": [],
    "reactions": []
  },
  {
    "id": "grafanaloki",
    "name": "Grafana Loki",
    "tagline": "Like Prometheus, but for logs",
    "url": "https://grafana.com/oss/loki",
    "logo": "https://grafana.com/static/img/logos/logo-loki.svg",
    "category": "observability",
    "features": {
      "builtin-ui": {
        "value": "❌",
        "note": "Requires Grafana"
      },
      "supports-otel": "✅",
      "observability-traces": "❌",
      "observability-logs": "✅",
      "observability-metrics": "❌",
      "backend-storage": "S3, GCS or Azure Blob Storage",
      "license": "AGPL-3.0"
    },
    "description": "Grafana Loki is a straightforward and efficient logging system that helps users collect, store, and analyze logs from their applications and systems. It is a popular choice for those seeking a lightweight and cost-effective log aggregation solution. Unlike traditional logging systems that may become resource-intensive, Grafana Loki excels in simplicity and scalability, making it an attractive option for organizations of various sizes.\n\nOne key feature of Grafana Loki is its ability to handle large volumes of log data while maintaining a low storage footprint. It achieves this by utilizing a unique, index-free architecture that efficiently organizes and retrieves log information. Users appreciate the efficient storage mechanism, which not only helps in managing costs but also makes it easier to navigate and analyze logs, leading to quicker issue resolution.\n\nGrafana Loki's integration with Grafana, a popular open-source monitoring and observability platform, adds to its appeal. Users can seamlessly visualize and explore their log data alongside other monitoring metrics, creating a cohesive and comprehensive view of their systems. This integration simplifies the troubleshooting process and enhances the overall observability of applications and infrastructure. The combination of efficient storage, scalability, and integration with Grafana makes Grafana Loki a preferred choice for those looking for a user-friendly and cost-effective log aggregation solution.\n",
    "issue": 7,
    "images": [],
    "alternatives": [],
    "reviews": [],
    "reactions": []
  },
  {
    "id": "grafanatempo",
    "name": "Grafana Tempo",
    "tagline": "High volume, minimal dependency distributed tracing backend",
    "url": "https://grafana.com/oss/tempo",
    "logo": "https://grafana.com/static/assets/img/logos/grafana-tempo.svg",
    "category": "observability",
    "features": {
      "initial-release": "Jun '21",
      "cncf-stage": "—",
      "builtin-ui": {
        "value": "❌",
        "note": "Requires Grafana"
      },
      "supports-otel": "✅",
      "observability-traces": "✅",
      "observability-logs": "❌",
      "observability-metrics": "❌",
      "backend-storage": "S3, GCS or Azure Blob Storage",
      "license": "AGPL-3.0"
    },
    "images": [
      {
        "alt": "Traces - Service Graph View using Grafana",
        "src": "https://raw.githubusercontent.com/grafana/tempo/main/docs/sources/tempo/getting-started/assets/grafana-query.png"
      },
      {
        "alt": "How does Tempo work?",
        "src": "https://grafana.com/static/img/traces/how-does-tempo-work.png"
      }
    ],
    "alternatives": [
      "signoz",
      "jaeger"
    ],
    "description": "Grafana Tempo is a user-friendly distributed tracing system that helps organizations gain insights into the performance and behavior of their applications. It is designed for simplicity and efficiency in collecting and analyzing traces, making it a popular choice for those seeking an uncomplicated and effective solution for understanding their system's performance. Unlike complex alternatives, Grafana Tempo focuses on ease of use without compromising on powerful tracing capabilities.\n\nOne key advantage of Grafana Tempo is its cost-effectiveness. It employs a unique storage strategy that allows users to store traces in their own object storage, such as Amazon S3 or Google Cloud Storage. This approach reduces infrastructure costs, making it an attractive option for organizations looking to benefit from distributed tracing without breaking the bank. Users appreciate the flexibility of choosing their storage solution based on their budget and performance requirements.\n\nGrafana Tempo also stands out for its open and vendor-neutral approach. It provides compatibility with the OpenTelemetry standard, allowing users to easily integrate with various instrumentation libraries and export traces to Tempo. This openness fosters interoperability and ensures that users are not locked into a specific vendor or technology stack. Organizations choose Grafana Tempo for its simplicity, cost-effectiveness, and commitment to industry standards, making distributed tracing more accessible and manageable for a wide range of users.\n",
    "issue": 1,
    "reviews": [
      {
        "login": "goenning",
        "avatar_url": "https://avatars.githubusercontent.com/u/94755?v=4",
        "html_url": "https://github.com/aptakube/kubedir/issues/1#issuecomment-1888238084",
        "rating": 5,
        "body": "Very good, I love this service!\r\nI have used it for many years.",
        "created_at": "2024-01-12T01:15:25Z"
      }
    ],
    "reactions": [
      {
        "login": "goenning",
        "content": "+1",
        "avatar_url": "https://avatars.githubusercontent.com/u/94755?v=4",
        "created_at": "2024-01-12T00:49:59Z"
      }
    ]
  },
  {
    "id": "jaeger",
    "name": "Jaeger",
    "tagline": "CNCF Jaeger, a Distributed Tracing Platform",
    "url": "https://www.jaegertracing.io",
    "logo": "https://avatars.githubusercontent.com/u/28545596?s=200&v=4",
    "category": "observability",
    "features": {
      "initial-release": "Aug '15",
      "cncf-stage": "Graduated",
      "builtin-ui": "✅",
      "supports-otel": "✅",
      "backend-storage": "In-Memory, Cassandra, Elasticsearch or Kafka",
      "observability-traces": "✅",
      "observability-logs": "❌",
      "observability-metrics": "❌",
      "license": "Apache-2.0"
    },
    "alternatives": [
      "signoz",
      "grafanatempo"
    ],
    "description": "Jaeger is a widely used open-source distributed tracing system that assists developers and organizations in understanding and optimizing the performance of their applications. It provides a clear picture of the interactions between various components in a system, helping identify bottlenecks and issues affecting the overall user experience. Many users prefer Jaeger due to its simplicity, effectiveness, and strong community support.\n\nOne key feature of Jaeger is its ability to trace requests as they travel through different services and components in a distributed system. This tracing capability allows users to visualize the flow of requests, helping them pinpoint areas of latency and inefficiency. Jaeger's user-friendly interface makes it easy for developers and operators to analyze traces and identify performance bottlenecks, ultimately leading to quicker issue resolution and improved application performance.\n\nJaeger's broad ecosystem support is another reason for its popularity. It integrates seamlessly with various programming languages, frameworks, and platforms, making it versatile for a wide range of applications. The active community around Jaeger ensures regular updates, support, and a wealth of resources for users. Organizations often choose Jaeger for its accessibility, strong tracing capabilities, and the ability to integrate with diverse technology stacks, making it a reliable tool for optimizing the performance of distributed systems.\n",
    "issue": 8,
    "images": [],
    "reviews": [],
    "reactions": []
  },
  {
    "id": "k9s",
    "name": "k9s",
    "tagline": "Kubernetes CLI To Manage Your Clusters In Style!",
    "url": "https://github.com/derailed/k9s",
    "logo": "https://raw.githubusercontent.com/derailed/k9s/master/assets/k9s.png",
    "category": "desktop-clients",
    "features": {
      "interface": "Terminal",
      "multi-cluster": "❌",
      "port-foward": "✅",
      "aggregated-logs": "✅",
      "open-source": "✅"
    },
    "description": "K9s is a user-friendly and efficient command-line interface designed to simplify the management of Kubernetes clusters. With its intuitive design, K9s allows users to seamlessly navigate and interact with their Kubernetes resources without the need for complex commands or extensive knowledge of Kubernetes internals.\n\nOne key advantage of K9s is its straightforward usability. Users appreciate its clear and concise interface that makes it easy to view, edit, and troubleshoot resources within a Kubernetes cluster. K9s' simplicity doesn't compromise functionality; it provides a quick and convenient way for both beginners and experienced users to handle day-to-day tasks efficiently.\n\nPeople often choose K9s over alternative Kubernetes management tools because of its focus on simplicity, speed, and ease of use. Its streamlined interface and responsive commands make it a preferred choice for those who want a hassle-free experience when interacting with Kubernetes clusters. K9s stands out as a practical and accessible solution, enabling users to manage their containerized applications effortlessly.\n",
    "issue": 9,
    "images": [],
    "alternatives": [],
    "reviews": [],
    "reactions": []
  },
  {
    "id": "lens",
    "name": "Lens",
    "tagline": "The way the world runs Kubernetes",
    "url": "https://k8slens.dev",
    "logo": "https://avatars.githubusercontent.com/u/62133242?s=200&v=4",
    "category": "desktop-clients",
    "features": {
      "interface": "Graphical",
      "multi-cluster": "❌",
      "port-foward": "✅",
      "aggregated-logs": "❌",
      "open-source": "❌"
    },
    "alternatives": [
      "k9s",
      "aptakube"
    ],
    "description": "Lens is a user-friendly and powerful tool designed to simplify the management of containerized applications. It stands out for its intuitive interface, making it easy for both beginners and experienced users to navigate and oversee their containerized environments effortlessly. With Lens, users can gain a comprehensive view of their clusters, providing insights into resource utilization, pod health, and overall system performance.\n\nOne key advantage of Lens is its cross-platform compatibility, supporting various container runtimes and orchestration systems. This versatility makes it a go-to choice for those working with different container technologies, enabling them to manage clusters seamlessly without the need for multiple tools. Additionally, Lens fosters collaboration among team members by allowing easy sharing of cluster configurations and access credentials, streamlining the development and operations workflow.\n\nUsers appreciate Lens for its real-time monitoring capabilities, offering instant feedback on the status of containers and applications. This real-time visibility helps teams identify and address issues promptly, minimizing downtime and enhancing overall system reliability. In essence, Lens simplifies the complexities of container management, making it a preferred choice for those seeking an accessible, efficient, and collaborative solution for overseeing their containerized environments.\n",
    "issue": 10,
    "images": [],
    "reviews": [],
    "reactions": []
  },
  {
    "id": "signoz",
    "name": "SigNoz",
    "tagline": "OpenTelemetry-Native Traces, Metrics, and Logs in a single pane",
    "url": "https://signoz.io",
    "logo": "https://signoz.io/img/SigNozLogo-orange.svg",
    "category": "observability",
    "features": {
      "initial-release": "Feb '21",
      "cncf-stage": "Incubated",
      "builtin-ui": "✅",
      "supports-otel": "✅",
      "backend-storage": "ClickHouse",
      "observability-traces": "✅",
      "observability-logs": "✅",
      "observability-metrics": "✅",
      "license": "MIT + Enterprise"
    },
    "alternatives": [
      "jaeger",
      "grafanatempo"
    ],
    "description": "SigNoz is a user-friendly and efficient open-source observability platform designed to help businesses monitor and troubleshoot their applications effortlessly. With a focus on simplicity and practicality, SigNoz stands out among its alternatives for its easy setup and intuitive interface. Users appreciate its straightforward approach to observability, making it accessible to both seasoned developers and those new to monitoring applications.\n\nOne key strength of SigNoz is its robust performance in tracking and analyzing application performance metrics. It provides detailed insights into response times, error rates, and latency, helping teams identify and address issues promptly. SigNoz is known for its versatility, supporting various data sources and providing a unified platform for monitoring different components of an application stack.\n\nMoreover, what sets SigNoz apart is its cost-effectiveness. Being an open-source solution, it offers a budget-friendly alternative to expensive proprietary observability tools. Organizations choose SigNoz not just for its affordability but also for its reliability in ensuring applications run smoothly. In summary, SigNoz simplifies the complex task of observability, making it a popular choice for teams looking for an accessible, powerful, and cost-efficient solution to monitor and enhance their application performance.\n",
    "issue": 11,
    "images": [],
    "reviews": [],
    "reactions": []
  }
]